/*
-------------------------------------------------------------------------------
과제 - 최근 주문(거래) 이력 - Recency

내용: 각 고객별/주문일자 별 간격을 일수(day)로 출력.

*/
/*
준비
*/
USE Northwind;
GO


/*
-------------------------------------------------------------------------------
과제 - 최근 주문(거래) 이력

---------------------------------------------
CustomerID	OrderDate	OrderID	DateDiff
---------------------------------------------
ALFKI			1997-08-25 	10643		NULL
ALFKI			1997-10-03 	10692		39
ALFKI			1997-10-13 	10702		10
ALFKI			1998-01-15 	10835		94
ALFKI			1998-03-16 	10952		60
ALFKI			1998-04-09 	11011		24
ANATR			1996-09-18 	10308		NULL
ANATR			1997-08-08 	10625		324
ANATR			1997-11-28 	10759		112
ANATR			1998-03-04 	10926		96

*/

SELECT
	CustomerID
,	OrderDate
,	OrderID
	/* 여기에 코드 완성 */
,	OrderDiff = 

FROM dbo.Orders
ORDER BY CustomerID ASC, OrderDate DESC, OrderID DESC;


