/*
-------------------------------------------------------------------------------
과제 - 매장별 판매 비중과 수량 편차 구하기

내용: 
		1) 각 매장(stor_id)별 판매수량(qty)의 합과 평균
		2) 매장 전체 총 판매수량과 총 평균수량을 구한 뒤

		3) 각 매장별/서적별(title_id) 판매비중과 수량편차 
			그리고 총 판매수량 대비 판매비중과 수량편차를 출력

*/

/*
준비
*/
USE pubs;
GO

SELECT stor_id, title_id, qty 
FROM dbo.sales;

SELECT stor_id, stor_sum = SUM(qty), stor_avg = AVG(qty) 
FROM dbo.sales
GROUP BY stor_id;

SELECT sales_sum = SUM(qty), sales_avg = AVG(qty) 
FROM dbo.sales;



/*
과제

(아래는 출력 결과 중 일부)

stor_id title_id qty    stor_sum    stor_avg    sales_sum   sales_avg   판매비중/매장                                 판매편차/매장     전체비중                                    전체편차
------- -------- ------ ----------- ----------- ----------- ----------- --------------------------------------- ----------- --------------------------------------- -----------
6380    BU1032   5      8           4           493         23          62.50                                   1           1.01                                    -18
6380    PS2091   3      8           4           493         23          37.50                                   -1          0.61                                    -20
7066    PC8888   50     125         62          493         23          40.00                                   -12         10.14                                   27
7066    PS2091   75     125         62          493         23          60.00                                   13          15.21                                   52
7067    PS2091   10     90          22          493         23          11.11                                   -12         2.03                                    -13
7067    TC3218   40     90          22          493         23          44.44                                   18          8.11                                    17
7067    TC4203   20     90          22          493         23          22.22                                   -2          4.06                                    -3
7067    TC7777   20     90          22          493         23          22.22                                   -2          4.06                                    -3
7131    MC3021   25     130         21          493         23          19.23                                   4           5.07                                    2
7131    PS1372   20     130         21          493         23          15.38                                   -1          4.06                                    -3

...... (이하 생략)

*/
WITH StoreSales AS
(
),
TotalSales AS
(
)
SELECT s.stor_id, s.title_id, s.qty
	,	a.stor_sum
	,	a.stor_avg
	,	t.sales_sum
	,	t.sales_avg
	,	[판매비중/매장] = 
	,  [판매편차/매장] = 
	,  [전체비중] = 
	,  [전체편차] = 

FROM dbo.sales AS s

;

